do

function run(msg, matches)
	if msg.to.type == 'chat' then
  return ' Fun Command List'..[[

❤لیست دستورات💙:

🔴weather [شهر|کشور]
🔹مشاهده اب و هوای شهر یا کشور مورد نظر
🔴!insta [یوزر]
🔹مشاهده مشخصات اینساگرام فرد مورد نظر
🔴info
🔹مشخصات کامل فرد همراه با (ریپلی|یوزر)
🔴me
🔹دیدن مقام خود در گروه
🔴!time
🔹مشاهده زمان و تاریخ
🔴!shortlink [لینک]
🔹کوتاه کردن لینک مورد نظر
🔴!tr fa [متن]
🔹ترجمه متن انگلیسی به فارسی
🔹مثال :
🔵!tr fa Hello
🔴!calc [معادله]
🔹حساب کردن معادله
🔹مثال :
🔵!calc 3*6
➖➖➖➖➖➖➖
🔴!sticker
🔹تبدیل عکس به استیکر با ریپلی
🔴!photo
🔹تبدیل استیکر به عکس با ریپلی
🔴!text (متن انگلیسی)
🔹تبدیل متن به عکس
🔴!tts (متن)
🔹تبدیل متن به ویس
➖➖➖➖➖➖➖
🔴map map (شهر|کشور|مکان)
🔹نقشه شهر،کشور یا مکان مورد نظر
🔴map loc (شهر|کشور|مکان)
🔹لوکیشن شهر،کشور یا مکان مورد نظر
🔴map link (شهر|کشور|مکان)
🔹لینک نقشه شهر،کشور یا مکان مورد نظر در گوگل
🔴‌map gps (شهر|کشور|مکان)
🔹مختصات شهر،کشور یا مکان مورد نظر
🔴!google (متن)
🔹سرچ متن در گوگل
🔴!echo (متن)
🔹تکرار کلمه
➖➖➖➖➖➖➖]]
end
end
return {
  description = "Robot About", 
  usage = "help: View Robot About",
  patterns = {
    "^[#!/]helpfun$"
    }, 
  run = run 
}

end
